Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute.xDir Property
 The X-axis direction.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector xDir { get; }
Public ReadOnly Property xDir As Vector
	Get
Property Value
Type: Vector
See Also
Reference
ReferenceModelObjectAttribute Class
Tekla.Structures.Model.Collaboration Namespace